results/ai-agent/logs/chaos-spike-logs/k6-chaos-spike-run3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 03/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 03/50 VUs  0m01.0s/1m10.0s

running (0m02.0s), 05/50 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  0m02.0s/1m10.0s

running (0m03.0s), 08/50 VUs, 5 complete and 0 interrupted iterations
default   [   4% ] 08/50 VUs  0m03.0s/1m10.0s

running (0m04.0s), 10/50 VUs, 14 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  0m04.0s/1m10.0s

running (0m05.0s), 13/50 VUs, 28 complete and 0 interrupted iterations
default   [   7% ] 13/50 VUs  0m05.0s/1m10.0s

running (0m06.0s), 15/50 VUs, 45 complete and 0 interrupted iterations
default   [   9% ] 15/50 VUs  0m06.0s/1m10.0s

running (0m07.0s), 18/50 VUs, 63 complete and 0 interrupted iterations
default   [  10% ] 18/50 VUs  0m07.0s/1m10.0s

running (0m08.0s), 20/50 VUs, 84 complete and 0 interrupted iterations
default   [  11% ] 20/50 VUs  0m08.0s/1m10.0s

running (0m09.0s), 23/50 VUs, 109 complete and 0 interrupted iterations
default   [  13% ] 23/50 VUs  0m09.0s/1m10.0s

running (0m10.0s), 25/50 VUs, 132 complete and 0 interrupted iterations
default   [  14% ] 25/50 VUs  0m10.0s/1m10.0s

running (0m11.0s), 27/50 VUs, 159 complete and 0 interrupted iterations
default   [  16% ] 27/50 VUs  0m11.0s/1m10.0s

running (0m12.0s), 30/50 VUs, 186 complete and 0 interrupted iterations
default   [  17% ] 30/50 VUs  0m12.0s/1m10.0s

running (0m13.0s), 32/50 VUs, 220 complete and 0 interrupted iterations
default   [  19% ] 32/50 VUs  0m13.0s/1m10.0s

running (0m14.0s), 35/50 VUs, 247 complete and 0 interrupted iterations
default   [  20% ] 35/50 VUs  0m14.0s/1m10.0s

running (0m15.0s), 37/50 VUs, 278 complete and 0 interrupted iterations
default   [  21% ] 37/50 VUs  0m15.0s/1m10.0s

running (0m16.0s), 40/50 VUs, 307 complete and 0 interrupted iterations
default   [  23% ] 40/50 VUs  0m16.0s/1m10.0s

running (0m17.0s), 42/50 VUs, 342 complete and 0 interrupted iterations
default   [  24% ] 42/50 VUs  0m17.0s/1m10.0s

running (0m18.0s), 45/50 VUs, 377 complete and 0 interrupted iterations
default   [  26% ] 45/50 VUs  0m18.0s/1m10.0s

running (0m19.0s), 47/50 VUs, 411 complete and 0 interrupted iterations
default   [  27% ] 47/50 VUs  0m19.0s/1m10.0s

running (0m20.0s), 49/50 VUs, 438 complete and 0 interrupted iterations
default   [  29% ] 49/50 VUs  0m20.0s/1m10.0s

running (0m21.0s), 50/50 VUs, 476 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m21.0s/1m10.0s

running (0m22.0s), 50/50 VUs, 506 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m22.0s/1m10.0s

running (0m23.0s), 50/50 VUs, 545 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m23.0s/1m10.0s

running (0m24.0s), 50/50 VUs, 581 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  0m24.0s/1m10.0s

running (0m25.0s), 50/50 VUs, 607 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  0m25.0s/1m10.0s

running (0m26.0s), 50/50 VUs, 644 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  0m26.0s/1m10.0s

running (0m27.0s), 50/50 VUs, 679 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  0m27.0s/1m10.0s

running (0m28.0s), 50/50 VUs, 711 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  0m28.0s/1m10.0s

running (0m29.0s), 50/50 VUs, 747 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  0m29.0s/1m10.0s

running (0m30.0s), 50/50 VUs, 778 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  0m30.0s/1m10.0s

running (0m31.0s), 50/50 VUs, 810 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  0m31.0s/1m10.0s

running (0m32.0s), 50/50 VUs, 848 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  0m32.0s/1m10.0s

running (0m33.0s), 50/50 VUs, 888 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  0m33.0s/1m10.0s

running (0m34.0s), 50/50 VUs, 920 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  0m34.0s/1m10.0s

running (0m35.0s), 50/50 VUs, 949 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  0m35.0s/1m10.0s

running (0m36.0s), 50/50 VUs, 986 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  0m36.0s/1m10.0s

running (0m37.0s), 50/50 VUs, 1020 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  0m37.0s/1m10.0s

running (0m38.0s), 50/50 VUs, 1052 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  0m38.0s/1m10.0s

running (0m39.0s), 50/50 VUs, 1084 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  0m39.0s/1m10.0s

running (0m40.0s), 50/50 VUs, 1121 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  0m40.0s/1m10.0s

running (0m41.0s), 50/50 VUs, 1158 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  0m41.0s/1m10.0s

running (0m42.0s), 50/50 VUs, 1192 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  0m42.0s/1m10.0s

running (0m43.0s), 50/50 VUs, 1229 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  0m43.0s/1m10.0s

running (0m44.0s), 50/50 VUs, 1262 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  0m44.0s/1m10.0s

running (0m45.0s), 50/50 VUs, 1299 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  0m45.0s/1m10.0s

running (0m46.0s), 50/50 VUs, 1331 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  0m46.0s/1m10.0s

running (0m47.0s), 50/50 VUs, 1359 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  0m47.0s/1m10.0s

running (0m48.0s), 50/50 VUs, 1397 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  0m48.0s/1m10.0s

running (0m49.0s), 50/50 VUs, 1436 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  0m49.0s/1m10.0s

running (0m50.0s), 50/50 VUs, 1466 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  0m50.0s/1m10.0s

running (0m51.0s), 50/50 VUs, 1503 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  0m51.0s/1m10.0s

running (0m52.0s), 50/50 VUs, 1545 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  0m52.0s/1m10.0s

running (0m53.0s), 50/50 VUs, 1580 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  0m53.0s/1m10.0s

running (0m54.0s), 50/50 VUs, 1606 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  0m54.0s/1m10.0s

running (0m55.0s), 50/50 VUs, 1642 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  0m55.0s/1m10.0s

running (0m56.0s), 50/50 VUs, 1672 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  0m56.0s/1m10.0s

running (0m57.0s), 50/50 VUs, 1705 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  0m57.0s/1m10.0s

running (0m58.0s), 50/50 VUs, 1732 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  0m58.0s/1m10.0s

running (0m59.0s), 50/50 VUs, 1769 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  0m59.0s/1m10.0s

running (1m00.0s), 50/50 VUs, 1802 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  1m00.0s/1m10.0s

running (1m01.0s), 49/50 VUs, 1839 complete and 0 interrupted iterations
default   [  87% ] 49/50 VUs  1m01.0s/1m10.0s

running (1m02.0s), 45/50 VUs, 1872 complete and 0 interrupted iterations
default   [  89% ] 45/50 VUs  1m02.0s/1m10.0s

running (1m03.0s), 40/50 VUs, 1910 complete and 0 interrupted iterations
default   [  90% ] 40/50 VUs  1m03.0s/1m10.0s

running (1m04.0s), 33/50 VUs, 1947 complete and 0 interrupted iterations
default   [  91% ] 33/50 VUs  1m04.0s/1m10.0s

running (1m05.0s), 31/50 VUs, 1973 complete and 0 interrupted iterations
default   [  93% ] 31/50 VUs  1m05.0s/1m10.0s

running (1m06.0s), 23/50 VUs, 2002 complete and 0 interrupted iterations
default   [  94% ] 23/50 VUs  1m06.0s/1m10.0s

running (1m07.0s), 18/50 VUs, 2028 complete and 0 interrupted iterations
default   [  96% ] 18/50 VUs  1m07.0s/1m10.0s

running (1m08.0s), 13/50 VUs, 2053 complete and 0 interrupted iterations
default   [  97% ] 13/50 VUs  1m08.0s/1m10.0s

running (1m09.0s), 08/50 VUs, 2067 complete and 0 interrupted iterations
default   [  99% ] 08/50 VUs  1m09.0s/1m10.0s

running (1m10.0s), 03/50 VUs, 2076 complete and 0 interrupted iterations
default   [ 100% ] 03/50 VUs  1m10.0s/1m10.0s


  █ TOTAL RESULTS 

    checks_total.......: 2079   29.493845/s
    checks_succeeded...: 49.30% 1025 out of 2079
    checks_failed......: 50.69% 1054 out of 2079

    ✗ Normal checkout processed
      ↳  0% — ✓ 0 / ✗ 1054
    ✓ Malicious checkout rejected

    HTTP
    http_req_duration..............: avg=331.33ms min=144.99ms med=281.93ms max=5.24s p(90)=559.67ms p(95)=652.53ms
      { expected_response:true }...: avg=306.44ms min=144.99ms med=277.26ms max=1.05s p(90)=533.48ms p(95)=577.48ms
    http_req_failed................: 25.00% 2079 out of 8316
    http_reqs......................: 8316   117.97538/s

    EXECUTION
    iteration_duration.............: avg=1.34s    min=620.42ms med=1.31s    max=6.5s  p(90)=1.79s    p(95)=1.98s   
    iterations.....................: 2079   29.493845/s
    vus............................: 3      min=3            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 67 MB  945 kB/s
    data_sent......................: 515 MB 7.3 MB/s



running (1m10.5s), 00/50 VUs, 2079 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  1m10s